---
kind: property
id: P:Autodesk.Revit.DB.PrintManager.PrintSetup
source: html/7604c459-c519-d9df-a99f-8374ab6e5ea5.htm
---
# Autodesk.Revit.DB.PrintManager.PrintSetup Property

The PrintSetup which manages the print settings of current document.

## Syntax (C#)
```csharp
public PrintSetup PrintSetup { get; }
```

## Remarks
PrintSetup is an interface cluster just like File->Print->Settings->Setup or File->Print Setup in UI.